#### Terraform Plan 📖
```
module.iam.aws_iam_group.frontend_developers: Refreshing state... [id=fuckwork-frontend-developers]
module.iam.aws_iam_policy.frontend_developers: Refreshing state... [id=arn:aws:iam::302222527269:policy/fuckwork-frontend-developers-policy]
module.iam.aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::302222527269:oidc-provider/token.actions.githubusercontent.com]
module.iam.aws_iam_group.administrators: Refreshing state... [id=fuckwork-administrators]
module.iam.aws_iam_role.rds_monitoring: Refreshing state... [id=fuckwork-dev-rds-monitoring-role]
module.iam.aws_iam_group.readonly: Refreshing state... [id=fuckwork-readonly]
module.iam.aws_iam_group.devops: Refreshing state... [id=fuckwork-devops]
module.iam.data.aws_caller_identity.current: Reading...
module.iam.aws_iam_role.ec2_backend: Refreshing state... [id=fuckwork-dev-ec2-backend-role]
module.iam.aws_iam_account_password_policy.strict[0]: Refreshing state... [id=iam-account-password-policy]
module.iam.data.aws_caller_identity.current: Read complete after 0s [id=302222527269]
module.auth.data.aws_region.current: Reading...
module.auth.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.iam.aws_iam_group.backend_developers: Refreshing state... [id=fuckwork-backend-developers]
data.aws_region.current: Reading...
data.aws_caller_identity.current: Reading...
data.aws_region.current: Read complete after 0s [id=us-east-1]
module.iam.aws_iam_group_policy_attachment.readonly: Refreshing state... [id=fuckwork-readonly-20251221092723717800000005]
module.iam.aws_iam_group_policy_attachment.administrators: Refreshing state... [id=fuckwork-administrators-20251221092723673700000003]
module.iam.aws_iam_role.github_actions_deploy: Refreshing state... [id=fuckwork-dev-github-actions-deploy-role]
module.iam.aws_iam_role.github_actions_terraform: Refreshing state... [id=fuckwork-github-actions-terraform-role]
data.aws_caller_identity.current: Read complete after 0s [id=302222527269]
module.iam.aws_iam_role.terraform_execution: Refreshing state... [id=fuckwork-dev-terraform-execution-role]
module.iam.aws_iam_policy.backend_developers: Refreshing state... [id=arn:aws:iam::302222527269:policy/fuckwork-backend-developers-policy]
module.iam.aws_iam_policy.ec2_backend: Refreshing state... [id=arn:aws:iam::302222527269:policy/fuckwork-dev-ec2-backend-policy]
module.iam.aws_iam_policy.github_actions_deploy: Refreshing state... [id=arn:aws:iam::302222527269:policy/fuckwork-dev-github-actions-deploy-policy]
module.iam.aws_iam_policy.require_mfa[0]: Refreshing state... [id=arn:aws:iam::302222527269:policy/fuckwork-require-mfa-policy]
module.iam.aws_iam_group_policy_attachment.frontend_developers: Refreshing state... [id=fuckwork-frontend-developers-2025122109272384780000000b]
module.iam.aws_iam_instance_profile.ec2_backend: Refreshing state... [id=fuckwork-dev-ec2-backend-profile]
module.iam.aws_iam_role_policy_attachment.rds_monitoring: Refreshing state... [id=fuckwork-dev-rds-monitoring-role-20251221092723779700000007]
module.iam.aws_iam_role_policy_attachment.ec2_backend: Refreshing state... [id=fuckwork-dev-ec2-backend-role-20251221092723808800000008]
module.iam.aws_iam_group_policy_attachment.backend_developers: Refreshing state... [id=fuckwork-backend-developers-20251221092723669900000002]
module.iam.aws_iam_group_policy_attachment.backend_developers_mfa[0]: Refreshing state... [id=fuckwork-backend-developers-20251221092723718000000006]
module.iam.aws_iam_group_policy_attachment.readonly_mfa[0]: Refreshing state... [id=fuckwork-readonly-20251221092723669800000001]
module.iam.aws_iam_group_policy_attachment.devops_mfa[0]: Refreshing state... [id=fuckwork-devops-2025122109272383460000000a]
module.iam.aws_iam_group_policy_attachment.administrators_mfa[0]: Refreshing state... [id=fuckwork-administrators-20251221092723712700000004]
module.iam.aws_iam_group_policy_attachment.frontend_developers_mfa[0]: Refreshing state... [id=fuckwork-frontend-developers-20251221092723833700000009]
module.iam.aws_iam_role_policy_attachment.github_actions_deploy: Refreshing state... [id=fuckwork-dev-github-actions-deploy-role-2025122109272420190000000d]
module.iam.aws_iam_role_policy_attachment.terraform_admin: Refreshing state... [id=fuckwork-dev-terraform-execution-role-2025122109272393570000000c]
module.iam.aws_iam_policy.devops: Refreshing state... [id=arn:aws:iam::302222527269:policy/fuckwork-devops-policy]
module.iam.aws_iam_policy.github_actions_terraform: Refreshing state... [id=arn:aws:iam::302222527269:policy/fuckwork-github-actions-terraform-policy]
module.iam.aws_iam_group_policy_attachment.devops: Refreshing state... [id=fuckwork-devops-2025122109272604430000000e]
module.iam.aws_iam_role_policy_attachment.github_actions_terraform: Refreshing state... [id=fuckwork-github-actions-terraform-role-2025122109272611450000000f]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.auth.aws_cognito_user_pool.main will be created
  + resource "aws_cognito_user_pool" "main" {
      + arn                        = (known after apply)
      + auto_verified_attributes   = [
          + "email",
        ]
      + creation_date              = (known after apply)
      + custom_domain              = (known after apply)
      + deletion_protection        = "INACTIVE"
      + domain                     = (known after apply)
      + email_verification_message = (known after apply)
      + email_verification_subject = (known after apply)
      + endpoint                   = (known after apply)
      + estimated_number_of_users  = (known after apply)
      + id                         = (known after apply)
      + last_modified_date         = (known after apply)
      + mfa_configuration          = "OFF"
      + name                       = "fuckwork-dev-users"
      + sms_verification_message   = (known after apply)
      + tags                       = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "fuckwork-dev-user-pool"
          + "Project"     = "fuckwork"
        }
      + tags_all                   = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "fuckwork-dev-user-pool"
          + "Project"     = "fuckwork"
          + "Repository"  = "github.com/ErdunE/Fuck-work"
        }
      + user_pool_tier             = (known after apply)
      + username_attributes        = [
          + "email",
        ]

      + account_recovery_setting {
          + recovery_mechanism {
              + name     = "verified_email"
              + priority = 1
            }
        }

      + email_configuration {
          + email_sending_account = "COGNITO_DEFAULT"
        }

      + password_policy {
          + minimum_length                   = 8
          + require_lowercase                = true
          + require_numbers                  = true
          + require_symbols                  = false
          + require_uppercase                = true
          + temporary_password_validity_days = 7
        }

      + schema {
          + attribute_data_type      = "String"
          + developer_only_attribute = false
          + mutable                  = true
          + name                     = "email"
          + required                 = true

          + string_attribute_constraints {
              + max_length = "256"
              + min_length = "1"
            }
        }

      + user_pool_add_ons {
          + advanced_security_mode = "OFF"
        }

      + verification_message_template {
          + default_email_option  = "CONFIRM_WITH_CODE"
          + email_message         = "Your verification code is {####}"
          + email_message_by_link = (known after apply)
          + email_subject         = "Your fuckwork verification code"
          + email_subject_by_link = (known after apply)
          + sms_message           = (known after apply)
        }
    }

  # module.auth.aws_cognito_user_pool_client.frontend will be created
  + resource "aws_cognito_user_pool_client" "frontend" {
      + access_token_validity                         = 1
      + allowed_oauth_flows                           = [
          + "code",
        ]
      + allowed_oauth_flows_user_pool_client          = true
      + allowed_oauth_scopes                          = [
          + "email",
          + "openid",
          + "profile",
        ]
      + auth_session_validity                         = (known after apply)
      + callback_urls                                 = [
          + "http://localhost:3000",
          + "http://localhost:3000/callback",
          + "http://localhost:5173",
          + "http://localhost:5173/callback",
        ]
      + client_secret                                 = (sensitive value)
      + default_redirect_uri                          = (known after apply)
      + enable_propagate_additional_user_context_data = (known after apply)
      + enable_token_revocation                       = (known after apply)
      + explicit_auth_flows                           = [
          + "ALLOW_REFRESH_TOKEN_AUTH",
          + "ALLOW_USER_PASSWORD_AUTH",
          + "ALLOW_USER_SRP_AUTH",
        ]
      + generate_secret                               = false
      + id                                            = (known after apply)
      + id_token_validity                             = 1
      + logout_urls                                   = [
          + "http://localhost:3000",
          + "http://localhost:5173",
        ]
      + name                                          = "fuckwork-dev-frontend-client"
      + prevent_user_existence_errors                 = "ENABLED"
      + read_attributes                               = (known after apply)
      + refresh_token_validity                        = 30
      + supported_identity_providers                  = [
          + "COGNITO",
        ]
      + user_pool_id                                  = (known after apply)
      + write_attributes                              = (known after apply)

      + token_validity_units {
          + access_token  = "hours"
          + id_token      = "hours"
          + refresh_token = "days"
        }
    }

  # module.auth.aws_cognito_user_pool_domain.main will be created
  + resource "aws_cognito_user_pool_domain" "main" {
      + aws_account_id                  = (known after apply)
      + cloudfront_distribution         = (known after apply)
      + cloudfront_distribution_arn     = (known after apply)
      + cloudfront_distribution_zone_id = (known after apply)
      + domain                          = "fuckwork-dev"
      + id                              = (known after apply)
      + managed_login_version           = (known after apply)
      + s3_bucket                       = (known after apply)
      + user_pool_id                    = (known after apply)
      + version                         = (known after apply)
    }

  # module.iam.aws_iam_role.ec2_backend will be updated in-place
  ~ resource "aws_iam_role" "ec2_backend" {
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action    = "sts:AssumeRole" -> [
                          + "sts:AssumeRole",
                          + "sts:TagSession",
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        id                    = "fuckwork-dev-ec2-backend-role"
        name                  = "fuckwork-dev-ec2-backend-role"
        tags                  = {
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
            "Name"        = "fuckwork-dev-ec2-backend-role"
            "Project"     = "fuckwork"
            "Purpose"     = "Backend application runtime"
            "Repository"  = "github.com/ErdunE/Fuck-work"
        }
        # (9 unchanged attributes hidden)
    }

  # module.iam.aws_iam_role.rds_monitoring will be updated in-place
  ~ resource "aws_iam_role" "rds_monitoring" {
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action    = "sts:AssumeRole" -> [
                          + "sts:AssumeRole",
                          + "sts:TagSession",
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        id                    = "fuckwork-dev-rds-monitoring-role"
        name                  = "fuckwork-dev-rds-monitoring-role"
        tags                  = {
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
            "Name"        = "fuckwork-dev-rds-monitoring-role"
            "Project"     = "fuckwork"
            "Purpose"     = "RDS enhanced monitoring"
            "Repository"  = "github.com/ErdunE/Fuck-work"
        }
        # (9 unchanged attributes hidden)
    }

Plan: 3 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  + cognito_client_id                 = (known after apply)
  + cognito_domain                    = "fuckwork-dev"
  + cognito_hosted_ui_url             = "https://fuckwork-dev.auth.us-east-1.amazoncognito.com"
  + cognito_issuer_url                = (known after apply)
  + cognito_user_pool_id              = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
Releasing state lock. This may take a few moments...

```